; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	spectrograph2 - mode
	infrared5 - mode
	infrared3 - mode
	spectrograph0 - mode
	spectrograph6 - mode
	spectrograph1 - mode
	thermograph4 - mode
	Star1 - direction
	GroundStation8 - direction
	Star9 - direction
	Star10 - direction
	GroundStation4 - direction
	GroundStation12 - direction
	Star7 - direction
	GroundStation11 - direction
	Star13 - direction
	Star0 - direction
	Star5 - direction
	Star2 - direction
	GroundStation3 - direction
	Star6 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 infrared5)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph6)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star13)
	(calibration_target instrument2 GroundStation11)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation12)
)
(:goal (and
	(pointing satellite0 GroundStation8)
	(have_image Star14 spectrograph0)
	(have_image Star15 spectrograph1)
	(have_image Planet16 spectrograph2)
	(have_image Planet16 thermograph4)
	(have_image Planet17 spectrograph1)
	(have_image Planet17 spectrograph2)
))

)

; plan
1. (turn_to satellite0 star2 groundstation12)
   deleted: (pointing satellite0 groundstation12)
   added: (pointing satellite0 star2)
   goals met: 0 of 7
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite0 planet16 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet16)
   goals met: 0 of 7
5. (take_image satellite0 planet16 instrument1 spectrograph2)
   added: (have_image planet16 spectrograph2)
   goals met: 1 of 7
6. (turn_to satellite0 planet17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet17)
   goals met: 1 of 7
7. (take_image satellite0 planet17 instrument1 spectrograph1)
   added: (have_image planet17 spectrograph1)
   goals met: 2 of 7
8. (take_image satellite0 planet17 instrument1 spectrograph2)
   added: (have_image planet17 spectrograph2)
   goals met: 3 of 7
9. (turn_to satellite0 groundstation11 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 groundstation11)
   goals met: 3 of 7
10. (turn_to satellite0 star15 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 star15)
   goals met: 3 of 7
11. (take_image satellite0 star15 instrument1 spectrograph1)
   added: (have_image star15 spectrograph1)
   goals met: 4 of 7
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 7
13. (turn_to satellite0 groundstation8 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 groundstation8)
   goals met: 5 of 7
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 7
15. (turn_to satellite0 star7 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 star7)
   goals met: 4 of 7
16. (calibrate satellite0 instrument0 star7)
   added: (calibrated instrument0)
   goals met: 4 of 7
17. (turn_to satellite0 groundstation11 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation11)
   goals met: 4 of 7
18. (turn_to satellite0 planet16 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 planet16)
   goals met: 4 of 7
19. (take_image satellite0 planet16 instrument0 thermograph4)
   added: (have_image planet16 thermograph4)
   goals met: 5 of 7
20. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 7
21. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 5 of 7
22. (turn_to satellite0 groundstation8 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 groundstation8)
   goals met: 6 of 7
23. (turn_to satellite0 star5 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 star5)
   goals met: 5 of 7
24. (calibrate satellite0 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 5 of 7
25. (turn_to satellite0 groundstation8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation8)
   goals met: 6 of 7
26. (turn_to satellite0 star14 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 star14)
   goals met: 5 of 7
27. (take_image satellite0 star14 instrument2 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 6 of 7
28. (turn_to satellite0 groundstation8 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation8)
   goals met: 7 of 7
